backend_api/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@elibrary.com'
---
    public function login()
    {
        $input = $this->request->getJSON(true);

        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[6]',
        ];

        if (!$this->validate($rules)) {
            return $this->respond([
                'status'  => 422,
                'message' => 'Validasi gagal.',
                'errors'  => $this->validator->getErrors(),
            ], 422);
        }

        $db = \Config\Database::connect();

        $user = $db->table('users')
            ->where('email', $input['email'])
            ->get()->getRowArray();