backend_api/app/Controllers/BukuController.php

SELECT `b`.*, `g`.`nama_genre`, `p`.`nama` AS `nama_penulis`, `p`.`penerbit`
FROM `buku` `b`
LEFT JOIN `genres` `g` ON `g`.`id` = `b`.`genre_id`
LEFT JOIN `penulis` `p` ON `p`.`id` = `b`.`penulis_id`
ORDER BY `b`.`id` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data = $db->table('buku b')
            ->select('b.*, g.nama_genre, p.nama AS nama_penulis, p.penerbit')
            ->join('genres g', 'g.id = b.genre_id', 'left')
            ->join('penulis p', 'p.id = b.penulis_id', 'left')
            ->orderBy('b.id', 'DESC')
            ->get()
            ->getResultArray();