backend_api/app/Controllers/StatsController.php

SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `genres`
SELECT COUNT(*) AS `numrows`
FROM `penulis`
SELECT COUNT(*) AS `numrows`
FROM `anggota`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
---
    public function index()
    {
        $db = \Config\Database::connect();

        $totalBuku       = $db->table('buku')->countAllResults();
        $totalGenre      = $db->table('genres')->countAllResults();
        $totalPenulis    = $db->table('penulis')->countAllResults();
        $totalAnggota    = $db->table('anggota')->countAllResults();
        $totalPeminjaman = $db->table('peminjaman')->countAllResults();
        $sedangDipinjam  = $db->table('peminjaman')->where('status', 'dipinjam')->countAllResults();