backend_api/app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $authHeader = $request->getHeaderLine('Authorization');

        if (empty($authHeader) || !str_starts_with($authHeader, 'Bearer ')) {
            return service('response')
                ->setStatusCode(401)
                ->setJSON(['status' => 401, 'message' => 'Token tidak ditemukan. Akses ditolak.']);
        }

        $token = trim(substr($authHeader, 7));
        $db    = \Config\Database::connect();
        $user  = $db->table('users')->where('token', $token)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `token` = '909bfa7c230e571c72e6596cac40372d84a2295346b8657b6597a98c597b6b6b'