backend_api/app/Models/PeminjamanModel.php

    public function getAllWithRelations()
    {
        return $this->db->table('peminjaman p')
            ->select('p.*, a.nama AS nama_anggota, b.judul AS judul_buku')
            ->join('anggota a', 'a.id = p.anggota_id', 'left')
            ->join('buku b',    'b.id = p.buku_id',    'left')
            ->orderBy('p.id', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `p`.*, `a`.`nama` AS `nama_anggota`, `b`.`judul` AS `judul_buku`
FROM `peminjaman` `p`
LEFT JOIN `anggota` `a` ON `a`.`id` = `p`.`anggota_id`
LEFT JOIN `buku` `b` ON `b`.`id` = `p`.`buku_id`
ORDER BY `p`.`id` DESC